{
  "backend/main.mo": "Motoko actor implementing a scoreboard with functions to record player scores, retrieve all scores in ascending/descending order, and get specific score entries by index with bounds checking.",
  "feature_evidence.json": "Feature evidence report documenting the keyboard controls debug/fix feature, linking it to useGameControls.ts and test requirement REQ-6 with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, pages, hooks, and configuration for the 3D cyberpunk-themed game application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for the cyberpunk UI design system.",
  "frontend/index.html": "HTML entry point with root div and module script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining root, index, game, and leaderboard routes, all wrapped in GameLayout component with RouterProvider.",
  "frontend/src/components/Game3DScene.tsx": "React Three Fiber 3D game scene with player sphere, collectible orbs, moving obstacles, collision detection, power-up mechanics, and game loop using useFrame hook.",
  "frontend/src/components/GameControls.tsx": "UI component displaying keyboard control instructions for WASD/arrow keys movement and ESC pause in a styled cyberpunk-themed panel.",
  "frontend/src/components/GameLayout.tsx": "Layout wrapper applying cyberpunk gradient background with game background image overlay and grid pattern effects to all child routes.",
  "frontend/src/components/Leaderboard.tsx": "Leaderboard display component fetching scores via useLeaderboard hook, showing ranked entries with trophy icons for top 3 and formatted player principals and scores.",
  "frontend/src/components/PowerUpIndicator.tsx": "HUD component conditionally rendering active power-up status with icon, animated glow effects, and invincibility label.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating and managing backend actor instances with Internet Identity authentication, handling anonymous and authenticated actors with automatic query invalidation.",
  "frontend/src/hooks/useGameControls.ts": "Custom hook managing keyboard input state for WASD, arrow keys, and space bar with event listeners, preventing stale closures by using functional state updates and empty dependency array.",
  "frontend/src/hooks/useGameEngine.ts": "Provides game engine utilities for collision detection, orb spawning at random positions, and obstacle spawning from random edges with velocities.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useLeaderboard.ts": "Hook that wraps the getAllScoresDescending query to provide leaderboard data with loading state and refresh capability.",
  "frontend/src/hooks/useQueries.ts": "React Query hook to fetch all scores in descending order from the backend actor.",
  "frontend/src/hooks/useScoreSubmission.ts": "Hook for submitting player scores to the backend using React Query mutations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom neon-themed color variables (cyan, magenta, yellow) and utility classes for glows, shadows, and grid patterns.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers wrapping the main App component.",
  "frontend/src/pages/GamePage.tsx": "Main game page component managing game state (menu, playing, paused, gameover), score tracking, power-ups, and rendering the 3D scene with HUD overlays.",
  "frontend/src/pages/LeaderboardPage.tsx": "Leaderboard page displaying top scores with header, navigation back to game, and footer with attribution.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with custom neon colors, shadows, animations, and OKLCH color space support.",
  "project_state.json": "Project metadata tracking implemented features, known issue with direction controls, and pending game state management feature request."
}